#### ViewDisplayBackground Members

---

|  |
| --- |
| ViewDisplayBackground Class   Methods   Properties   See Also |

The  ViewDisplayBackground  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateGradient | Creates an object that can be passed to  View.SetBackground  method to set the background of the Gradient type. |
| Public method Static member | CreateImage | Creates an object that can be passed to  View.SetBackground  method to set the background of the Image type. |
| Public method Static member | CreateSky | Creates an object that can be passed to  View.SetBackground  method to set the background of the SunAndClouds type. |
| Public method | Dispose | Releases all resources used by the  ViewDisplayBackground |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | BackgroundColor | The color of the horizon when the type is 'Gradient'. |
| Public property | GroundColor | The color of the ground when the type is 'Gradient' or 'SunAndClouds'. |
| Public property | HorizontalImageOffset | The distance between the left viewport boundary and the left edge of the background image. |
| Public property | HorizontalImageScale | The horizontal scale of the background image; the scale of 1.0 puts the image pixel-to-pixel. |
| Public property | ImageFlags | The image alignment indicators when the type is 'Image'. |
| Public property | ImagePath | The path to the image file when the type is 'Image'. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | SkyColor | The color of the sky when the type is 'Gradient'. |
| Public property | Type | The type of the background. |
| Public property | VerticalImageOffset | The distance between the bottom viewport boundary and the bottom edge of the background image. |
| Public property | VerticalImageScale | The vertical scale of the background image; the scale of 1.0 puts the image pixel-to-pixel. |

# See Also

ViewDisplayBackground Class

Autodesk.Revit.DB Namespace